export const chatData1 = [
  { id: 'Cru8e', type: 'question', msg: 'AI는 무엇인가요?' },
  {
    id: 'w0NCf',
    type: 'answer',
    msg: [
      {
        id: 'w0NCf1',
        evaluation: 'bad',
        md: `### AI의 실제 활용 사례
- **의료**: 질병 진단, 신약 개발, 환자 모니터링.
- **금융**: 사기 탐지, 시장 분석, 투자 전략 최적화.
- **제조**: 로봇 공정 자동화, 품질 관리.
- **교통**: 자율주행, 교통 관리.
- **소비자 서비스**: 가상 비서, 고객 서비스 챗봇.
`,
      },
      {
        id: 'w0NCf2',
        evaluation: '',
        md: `### AI의 장점과 한계
**장점**  
- 작업 효율성과 정확성을 크게 향상.
- 대량의 데이터를 분석하여 통찰력 제공.
- 위험한 환경에서 인간 대신 작업 수행.

**한계**  
- 윤리적 문제(프라이버시, 편향).
- 고성능 시스템 개발에 드는 높은 비용.
- 예기치 않은 결과나 의사 결정의 불투명성(블랙박스 문제).
`,
      },
    ],
  },
  { id: 'd7fsef', type: 'question', msg: 'AI의 실제 활용 사례?' },
  {
    id: 'zer7fg',
    type: 'answer',
    msg: [
      {
        id: 'zer7fg1',
        evaluation: 'good',
        md: `### AI의 실제 활용 사례
- **의료**: 질병 진단, 신약 개발, 환자 모니터링.
- **금융**: 사기 탐지, 시장 분석, 투자 전략 최적화.
- **제조**: 로봇 공정 자동화, 품질 관리.
- **교통**: 자율주행, 교통 관리.
- **소비자 서비스**: 가상 비서, 고객 서비스 챗봇.
`,
      },
    ],
  },
  { id: 'd7fs88ef', type: 'question', msg: 'AI의 주요 구성 요소' },
  {
    id: 'zer7f88g',
    type: 'answer',
    msg: [
      {
        id: 'zer7fg1',
        evaluation: '',
        md: `1. **머신러닝(Machine Learning)**  
   - 데이터를 통해 학습하고 예측이나 결정을 내리는 AI 기술입니다.  
   - 알고리즘이 스스로 데이터를 분석하고 패턴을 찾아 행동을 개선합니다.  
   - 예: 스팸 이메일 필터링, 추천 시스템(Netflix, YouTube).
---
2. **딥러닝(Deep Learning)**  
   - 머신러닝의 하위 분야로, 인공신경망(Artificial Neural Networks)을 사용해 복잡한 데이터를 처리합니다.  
   - 이미지 인식, 음성 인식, 자연어 처리(NLP)에서 탁월한 성능을 발휘합니다.  
   - 예: 자율주행 자동차, 음성 비서(Alexa, Siri).
---
3. **자연어 처리(NLP, Natural Language Processing)**  
   - 인간의 언어를 이해하고 생성하는 AI 기술입니다.  
   - 텍스트 번역, 감정 분석, 챗봇 등에 사용됩니다.  
   - 예: 구글 번역, ChatGPT.
---
4. **컴퓨터 비전(Computer Vision)**  
   - 이미지를 분석하고 이해하는 기술입니다.  
   - 얼굴 인식, 의료 이미지 분석, 객체 탐지 등에 활용됩니다.  
   - 예: 안면 인식 출입 시스템, 자율 주행차의 도로 표지판 인식.

`,
      },
    ],
  },
];
